In [1]:
empTable = data.frame(ID = c(1,2,3), Name = c("Sai Narashima","Sai Rama", "Sai Krishna"))
empTable

  ID Name
1 1  Sai Narashima
2 2  Sai Rama
3 3  Sai Krishna

In [15]:
Department = c("IT","ECE","Doctor")
emp = cbind(empTable, Department)
emp

emp1 = data.frame(ID = c(4), Name = c("sridhar"), Department = "IT")
emp = rbind(emp,emp1)
emp

emp[1,]

  ID Name          Department
1 1  Sai Narashima IT
2 2  Sai Rama      ECE
3 3  Sai Krishna   Doctor

  ID Name          Department
1 1  Sai Narashima IT
2 2  Sai Rama      ECE
3 3  Sai Krishna   Doctor
4 4  sridhar       IT

  ID Name          Department
1 1  Sai Narashima IT